make_matcher_backend/app/models/api_key.rb

SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."key" = $1 AND "api_keys"."active" = $2 LIMIT $3  [["key", "{\"p\":\"7GO/4IeEm4Xwz30b9eAMTwCk6BNUe22yUO6hJZZ6E9YXo9Y/fg==\",\"h\":{\"iv\":\"uHdClzX6Wqa1rbJH\",\"at\":\"RjsI/MJ53+1maX3w55HdQw==\"}}"], ["active", true], ["LIMIT", 1]]
---
  def self.validate(token)
    key, secret, time = token.split("::")
    if DateTime.now.to_i - time.to_i >= 30
      puts "Timestamp expired."
      return false
    end

    if (api_key = ApiKey.find_by(key: key, active: true)).nil?